# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_monitor_data_collection_rule.prometheus: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDNmNzU3OS01ZjM5LTRkN2YtYmNlYS04ZTVjYjZkN2FjYTQ7b2JqZWN0SWQ9MDJiMTdkMjgtN2VjOC00MDg0LTkyY2UtZDI2MDUxZmE0OTk4O3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_resource_group.rg_dp_prod: Reading...
data.azurerm_resource_group.rg_dp_stag: Reading...
data.azurerm_resource_group.rg_dp_prod: Read complete after 0s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg]
data.azurerm_resource_group.rg_dp_stag: Read complete after 1s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg]
data.azurerm_log_analytics_workspace.dp_law_prod: Reading...
data.azurerm_log_analytics_workspace.dp_law_stag: Reading...
data.azurerm_monitor_data_collection_rule.prometheus: Read complete after 2s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw_norwayeast_managed/providers/Microsoft.Insights/dataCollectionRules/k6tests-amw]
data.azurerm_log_analytics_workspace.dp_law_stag: Read complete after 1s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-staging-insightsWorkspace]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Reading...
data.azurerm_log_analytics_workspace.dp_law_prod: Read complete after 1s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-prod-insightsWorkspace]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg]
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-yt01-insightsWorkspace]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-test-insightsWorkspace]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.k6tests will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "k6tests" {
        id                                  = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster"
        name                                = "k6tests-cluster"
        tags                                = {}
        # (33 unchanged attributes hidden)

      ~ default_node_pool {
          ~ auto_scaling_enabled          = false -> true
          ~ max_count                     = 0 -> 10
          ~ min_count                     = 0 -> 1
            name                          = "default"
            tags                          = {}
            # (27 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # azurerm_kubernetes_cluster_node_pool.prometheus will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "prometheus" {
      + auto_scaling_enabled  = false
      + eviction_policy       = "Delete"
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster"
      + max_pods              = (known after apply)
      + mode                  = "User"
      + name                  = "prometheus"
      + node_count            = 1
      + node_labels           = {
          + "kubernetes.azure.com/scalesetpriority" = "spot"
          + "prometheus"                            = "true"
        }
      + node_taints           = [
          + "kubernetes.azure.com/scalesetpriority=spot:NoSchedule",
          + "workload=prometheus:NoSchedule",
        ]
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Managed"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Spot"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_DS2_v2"
    }

  # azurerm_role_assignment.monitoring_reader_rg_dp_prod must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_dp_prod" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg/providers/Microsoft.Authorization/roleAssignments/fc44b433-e0eb-b3b5-881a-e4f89db37b02" -> (known after apply)
      ~ name                                   = "fc44b433-e0eb-b3b5-881a-e4f89db37b02" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_dp_stag must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_dp_stag" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg/providers/Microsoft.Authorization/roleAssignments/fa88b116-c98a-fa98-14e8-c7860b2e2713" -> (known after apply)
      ~ name                                   = "fa88b116-c98a-fa98-14e8-c7860b2e2713" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_dp_test["dp-be-test-rg"] must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_dp_test" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg/providers/Microsoft.Authorization/roleAssignments/61e136d2-b6f7-e743-e558-1ec6a167e0bf" -> (known after apply)
      ~ name                                   = "61e136d2-b6f7-e743-e558-1ec6a167e0bf" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_dp_test["dp-be-yt01-rg"] must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_dp_test" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg/providers/Microsoft.Authorization/roleAssignments/d1b24ef8-fe3a-af5b-5a72-776c4c6ce14d" -> (known after apply)
      ~ name                                   = "d1b24ef8-fe3a-af5b-5a72-776c4c6ce14d" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # helm_release.kube_prometheus_stack will be updated in-place
  ~ resource "helm_release" "kube_prometheus_stack" {
        id                         = "kube-prometheus-stack"
      ~ metadata                   = [
          - {
              - app_version    = "v0.79.2"
              - chart          = "kube-prometheus-stack"
              - first_deployed = 1733406099
              - last_deployed  = 1736749516
              - name           = "kube-prometheus-stack"
              - namespace      = "monitoring"
              - notes          = <<-EOT
                    kube-prometheus-stack has been installed. Check its status by running:
                      kubectl --namespace monitoring get pods -l "release=kube-prometheus-stack"
                    
                    Visit https://github.com/prometheus-operator/kube-prometheus for instructions on how to create & configure Alertmanager and Prometheus instances using the Operator.
                    
                    1. Get the application URL by running these commands:
                      export POD_NAME=$(kubectl get pods --namespace monitoring -l "app.kubernetes.io/name=prometheus-node-exporter,app.kubernetes.io/instance=kube-prometheus-stack" -o jsonpath="{.items[0].metadata.name}")
                      echo "Visit http://127.0.0.1:9100 to use your application"
                      kubectl port-forward --namespace monitoring $POD_NAME 9100
                    kube-state-metrics is a simple service that listens to the Kubernetes API server and generates metrics about the state of the objects.
                    The exposed metrics can be found here:
                    https://github.com/kubernetes/kube-state-metrics/blob/master/docs/README.md#exposed-metrics
                    
                    The metrics are exported on the HTTP endpoint /metrics on the listening port.
                    In your case, kube-prometheus-stack-kube-state-metrics.monitoring.svc.cluster.local:8080/metrics
                    
                    They are served either as plaintext or protobuf depending on the Accept header.
                    They are designed to be consumed either by Prometheus itself or by a scraper that is compatible with scraping a Prometheus client endpoint.
                EOT
              - revision       = 6
              - values         = jsonencode(
                    {
                      - alertmanager = {
                          - enabled = true
                        }
                      - crds         = {
                          - enabled = false
                        }
                      - grafana      = {
                          - enabled = false
                        }
                      - prometheus   = {
                          - enabled        = true
                          - prometheusSpec = {
                              - enableRemoteWriteReceiver = true
                              - externalLabels            = {
                                  - cluster = "k6tests-cluster"
                                }
                              - podMetadata               = {
                                  - labels = {
                                      - "azure.workload.identity/use" = "true"
                                    }
                                }
                              - priorityClassName         = "system-cluster-critical"
                              - remoteWrite               = [
                                  - {
                                      - azureAd = {
                                          - cloud = "AzurePublic"
                                          - sdk   = {
                                              - tenantId = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
                                            }
                                        }
                                      - url     = "https://k6tests-amw-0vej.norwayeast-1.metrics.ingest.monitor.azure.com/dataCollectionRules/dcr-81e9cf1b38fb4648b047399c5593ebda/streams/Microsoft-PrometheusMetrics/api/v1/write?api-version=2023-04-24"
                                    },
                                ]
                              - retention                 = "1d"
                              - storageSpec               = {
                                  - volumeClaimTemplate = {
                                      - spec = {
                                          - resources = {
                                              - requests = {
                                                  - storage = "5Gi"
                                                }
                                            }
                                        }
                                    }
                                }
                            }
                          - serviceAccount = {
                              - annotations = {
                                  - "azure.workload.identity/client-id" = "c4eeeead-8978-41a4-a989-e6e4aa9df603"
                                }
                            }
                        }
                    }
                )
              - version        = "67.9.0"
            },
        ] -> (known after apply)
        name                       = "kube-prometheus-stack"
      ~ values                     = [
          ~ <<-EOT
                crds:
                  enabled: false
                alertmanager:
                  enabled: true
                grafana:
                  enabled: false
                prometheus:
                  enabled: true
                  serviceAccount:
                    annotations:
                      azure.workload.identity/client-id: "c4eeeead-8978-41a4-a989-e6e4aa9df603"
                  prometheusSpec:
                    podMetadata:
                      labels:
                        azure.workload.identity/use: "true"
                    externalLabels:
                      cluster: "k6tests-cluster"
                    enableRemoteWriteReceiver: true
                    remoteWrite:
                      - url: "https://k6tests-amw-0vej.norwayeast-1.metrics.ingest.monitor.azure.com/dataCollectionRules/dcr-81e9cf1b38fb4648b047399c5593ebda/streams/Microsoft-PrometheusMetrics/api/v1/write?api-version=2023-04-24"
                        azureAd:
                          cloud: "AzurePublic"
                          sdk:
                            tenantId: "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
              +     tolerations:
              +       - key: "kubernetes.azure.com/scalesetpriority"
              +         operator: "Equal"
              +         value: "spot"
              +         effect: "NoSchedule"
              +       - key: "workload"
              +         operator: "Equal"
              +         value: "prometheus"
              +         effect: "NoSchedule"
              +     resources:
              +       requests:
              +         memory: 8Gi
                    priorityClassName: "system-cluster-critical"
                    retention: 1d
                    storageSpec:
                      volumeClaimTemplate:
                        spec:
                          resources:
                            requests:
              -               storage: 5Gi
              +               storage: 15Gi
            EOT,
        ]
        # (26 unchanged attributes hidden)
    }

Plan: 5 to add, 2 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @monteiro-renato |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/altinn-monitor-test-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/altinn-monitor-test-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_altinn-monitor-test-rg.tfstate.tfplan`